# NewFamilyInstanceCreationData Method (Face, Line, FamilySymbol) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewFamilyInstanceCreationData Method (Face, Line, FamilySymbol)
Application Class See Also
---
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	Face face,
	Line position,
	FamilySymbol symbol
)
```

Visual Basic
---
```text
Public Function NewFamilyInstanceCreationData ( _
	face As Face, _
	position As Line, _
	symbol As FamilySymbol _
) As FamilyInstanceCreationData
```

Visual C++
---
```text
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	Face^ face,
	Line^ position,
	FamilySymbol^ symbol
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..FaceA face of a geometry object.
position
    Type: Autodesk.Revit.DB..::..LineA line on the face defining where the symbol is to be placed.
symbol
    Type: Autodesk.Revit.DB..::..FamilySymbolA FamilySymbol object that represents the type of the instance that is to be inserted.
# See Also
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace